---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MassFailures.MinSkylightWidthImperial
source: html/f533a8f0-2a16-2da5-264f-f5ae656b968b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MassFailures.MinSkylightWidthImperial Property

The minimum skylight width is 8 inches.

## Syntax (C#)
```csharp
public static FailureDefinitionId MinSkylightWidthImperial { get; }
```